深度探索C++对象模型 笔记

[TOC]

# 第1章 关于对象

## 1.1 C++对象模型

成员分类：

数据成员：static、non-static

成员函数：static、non-static、virtual

```c++
class Point {
public:
    Point( float xval );
    virtual ~Point();
    
    float x() const;
    static int PointCount();

protected:
	virtual ostream& print( ostream &os ) const;  
    
    float _x;
    static int _point_count;
};
```

![](../../pics/language/Inside_the_C++_Object_Model/Pic_1_2_C++对象模型.png)

每个类有一堆指向虚函数的指针，存放在表格中，这个表格称为**虚函数表**（vtbl），虚函数表的第一个slot中存放的是type_info，用于动态绑定时的类型识别。

该模型的优点：空间和存取时间的效率高

该模型的缺点：；类对象的非静态数据成员改变，需要重新编译

成员、函数放置的位置：

- 在类对象中的：
  - 1.non-static数据成员在每个类对象中
  - 2.虚基指针（vtbl）：如果有虚继承的话，在3.4节深入讨论
  - 2.虚函数指针（vptr）：指向类的虚函数表，设定和重置由类的构造函数、析构函数和拷贝赋值运算符自动完成
- 在对象之外的
  - 非虚函数：包括static、non-static
  - 静态数据成员

## 1.3 对象的差异

C++的多态只存在于一个个的public class继承体系中

**C++以以下方法支持多态：**

- 1.经由一组隐式的转化操作：把一个派生类的指针转化为一个指向public继承的基类指针
  - `shape *ps = new circle();`
- 2.经由虚函数机制
  - `ps->rotate();`
- 3.经由dynamic_cast和typeid运算符
  - `if( circle *pc = dynamic_cast<circle*>( ps ) )...`

多态的主要用途：经由一个共同的接口来影响类的封装

**sizeof一个类对象时需要考虑的部分：**

- 1.其non-static数据成员的总和
- 2.对齐导致填补的空间
- 3.支持虚函数和虚基类的指针

**类对象的布局：**

```c++
class ZooAnimal{
public:
    ZooAnimal();
    virtual ~ZooAnimal();
    virtual void rotate();
    
protected:
    int loc;
    string name;
};

ZooAnimal za( "Zoey" );
ZooAnimal *pza = &za;
```

za和pza的可能布局（注意string类型，string所存字符串长度与sizeof(对象)无关）：

![](../../pics/language/Inside_the_C++_Object_Model/Pic_1_4_独立class的object布局和pointer布局.png)


    X xx; //调用X的默认构造函数
    //...以y和z来处理xx
    return xx； //这里会调用X的构造函数
}
//编译器的行为
void bar( X &__result )
{
    X xx;
    xx.X::X(); //调用默认构造函数
    //...以y和z来处理xx
    __result.X::X( xx ); //调用拷贝构造函数
    return;
}


//使用者优化后，只调用一次构造函数，效率更高
X bar( const T &y, const T &z )
{
    return X( y, z )； //这里调用X的两个参数的构造函数，而省略了调用构造函数的步骤
}
//编译器的行为
void bar( X &__result )
{
    __result.X::X( y, z );
    return;
}
```

### 2.3.5 在编译器层面做优化

NRV优化，即Named Return Value，具体优化过程如下：

```c++
X bar()
{
    X xx;
    //...处理xx
    return xx;
}
//优化前
void bar( X &__result )
{
    X xx;
    xx.X::X(); //调用默认构造函数
    //...处理xx
    __result.X::X( xx ); //调用拷贝构造函数
    return;
}
//NRV优化后
void bar( X &__result )
{
    //以__result直接调用默认构造函数
    __result.X::X();
    //...直接处理__result
    
    return;
}
```

NRV优化的必备条件：类有拷贝构造函数

NRV优化的受争议的点：

- 1.优化由编译器默默完成，它是否真的被完成，不清楚
- 2.一旦函数变得复杂，优化就变得难以施行（cfront会只有top level时才进行NRV优化，如果有嵌套的局部块返回语句，则不进行NRV优化）
- 3.某些程序员不喜欢应用程序被优化

会出现的问题：拷贝静态/全局变量时应如何处理

```c++
Thing outer; //全局变量
//代码块，局部区域
{
    //inner应该从outer拷贝过来，还是直接只用outer而忽略inner
    Thing inner( outer ); 
}
```

### 2.3.6 拷贝构造函数：要还是不要

如果有大量的数据成员初始化操作，而你又想编译器为你做NRV优化，则可以显示声明一个inline的拷贝构造函数，以激活编译器的NRV优化

另一个需要注意的问题：在拷贝构造函数中使用memcpy和memset时，不能有该类不能有虚功能，否则会出错

```c++
Point3d::Point3d( const Point3d &rhs )
{
    memcpy( this, &rhs, sizeof(Point3d) );
}

//如果Point3d有虚功能，例如虚函数，则编译器的行为是
Point3d::Point3d()
{
    //vptr必须在使用者的代码之前先设定妥当
    vptr_Point3d = vtbl_Point3d;
    //vptr可能被设置为其他不合适的值，例如实际传入的是一个Point3d的派生类的对象
    memcpy( this, &rhs, sizeof(Point3d) );
}
```

## 2.4 成员们的初始化队列（初始化列表）

必须在初始化列表进行初始化的数据成员：

- 1.初始化一个引用成员时
- 2.初始化一个const成员时（但static const只能在类初始化，不能在初始化列表初始化）
- 3.调用一个基类的构造函数，而它拥有一组参数时（即调用基类的非默认构造函数）
  - 因为如果不在初始化列表调用想要调用的基类非默认构造函数，初始化列表会自动调用基类的默认构造函数
- 4.调用一个类成员对象的构造函数，而它拥有一组参数时（即调用类成员对象的非默认构造函数）
  - 因为如果不在初始化列表调用想要调用的类成员对象非默认构造函数，初始化列表会自动调用类成员对象的默认构造函数


**注意：**

- 1.对于类成员对象，最好在初始化列表初始化。
  - 初始化列表初始化，只有一步：
    - 调用对应的构造函数初始化类对象
  - 在函数体中初始化，效率不高，会执行以下几步：
    - 调用类成员的默认构造函数（初始化列表阶段时调用）
    - 创建临时变量
    - 使用类对象的赋值拷贝运算符，将临时变量赋值给类对象
    - 析构临时变量
- 2.初始化列表阶段，类成员的初始化顺序由声明顺序决定

```c++
//错误
class X{
    int i;
    int j;
public:
    X ( int val ): j(val),i(j){}
}
//正确
class X{
    int i;
    int j;
public:
    //在初始化列表阶段，若类对象在局部变量，i会初始化为0，否则，i不初始化
    //在这里，先执行初始化列表阶段，对i的行为是不确定的，但j会初始化为val
    //接着，执行i=j
    X ( int val ): j(val){
    	i = j;
    }
}
```

- 3.是否可以在构造函数中调用某个成员函数对数据成员进行初始化
  - 答案：可以，但最好是在函数体初始化是调用，而不要在初始化列表中调用，因为此时this还没初始化完全
- 4.在派生类的初始化列表中，调用基类的构造函数，使用派生类的成员函数返回值作为参数。
  - 最好不要这样做，因为this完成初始化


# 第3章 Data语意学

```c++
//书上的说法
class X { }; //sizeof(X)==1
class Y : public virtual X { }; //sizeof(Y)==8，因为虚指针+Y的空1byte+3bytes对齐
class Z : public virtual X { }; //sizeof(Z)==8，因为虚指针+Y的空1byte+3bytes对齐
class A : public Y, public Z { }; //sizeof(A)==12，因为虚指针*2+X的空1byte+3bytes对齐

//但在我自己的VS上测试的sizeof有所不同
class X { }; //sizeof(X)==1
class Y : public virtual X { }; //sizeof(Y)==4
class Z : public virtual X { }; //sizeof(Z)==4
class Test : public Y, public Z { }; //sizeof(A)==8

//VS中A的布局
1>class Test	size(8):
1>	    +---
1> 0	| +--- (base class Y)
1> 0	| | {vbptr}
1>	    | +---
1> 4	| +--- (base class Z)
1> 4	| | {vbptr}
1>	    | +---
1>	    +---
1>	    +--- (virtual base X)
1>	    +---
1>
1>       Test::$vbtable@Y@:
1> 0	| 0
1> 1	| 8 (Testd(Y+0)X)
1>
1>       Test::$vbtable@Z@:
1> 0	| 0
1> 1	| 4 (Testd(Z+0)X)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>               X       8       0       4 0
```

sizeof(X)为1，因为它有一个隐藏的1byte大小，那是被编译器安插进去的一个char，这使得该类的两个对象得以在内存中配置独一无二的地址

**一个类的大小（sizeof一个类或该类的对象），与一下几个因素相关**

- 1.语言本身造成的负担，如由虚函数、虚基类造成的虚函数指针和虚基指针
  - 虚基类的实现：
    - 虚基指针指向在该派生类中虚基类的子对象的起始位置
    - 虚基指针指向一个相关表格，表格中存放的是虚基类子对象的地址，或在该派生类对象上的偏移量（一般来说，在派生类对象的尾部）
- 2.编译器对于特殊情况提供的优化处理，例如：
  - 派生类本身也是空类，此时又虚继承于一个空类，由于派生类已经有一个4字节的指针，因此因自身空类产生的1字节就有能被优化掉（因为既然有成员了（虚基指针），就不需要安插一个char了）

**优化前**

![](../../pics/language/Inside_the_C++_Object_Model/空类优化前.png)

**优化后**

![](../../pics/language/Inside_the_C++_Object_Model/空类优化后.png)

**在我的VS测试的结果**

```c++
class A {};
class Test : virtual public A {};

int main()
{
    cout<<sizeof(Test)<<endl; //输出为4
    return 0;
}

//内存分布输出为：
1>class Test	size(4):
1>	    +---
1> 0	| {vbptr}
1>	    +---
1>	    +--- (virtual base A)
1>	    +---
1>
1>       Test::$vbtable@:
1> 0	| 0
1> 1	| 4 (Testd(Test+0)A)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>               A       4       0       4 0
```

- 3.对齐
- 4.其他非静态数据成员的大小

## 3.1 数据成员的绑定

**类成员的inline成员函数的数据成员绑定：**

- 1.函数体中的变量值的解析工作，在类声明完成之后才会进行
- 2.函数的参数列表中名称的解析工作，在出现参数列表代码的时候就开始进行

```c++
typedef int length;
int _val = 10;

class Point3d
{
public:
    //length为int，被解析为global，即::length
    // _val被解析为Point3d::_val;
    void mumble( length val ) { _val = val; }

private:
    typedef float length;
    //length被解析为float，即Point3d::length
    length _val;
};
```

为了避免2.中的情况，可以使用“防御性程序风格”

- a.把所有数据成员放在class声明起头处，以确保正确的绑定

除了a.之外，还有别的“防御性程序风格”，但这对解决上面2.的问题没有帮助

- b.把所有的inline functions，不管大小，都放在class声明之外

## 3.2 数据成员的布局

**非静态数据成员：**在每个类对象中的排序顺序与被声明的相对顺序一致，但不一定是连续的，介于两个数据成员之间的有可能是：

- 1.因对齐产生的字节
- 2.因虚功能产生的指针（虚函数指针、虚基类指针）
  - 虚指针的位置：
    - 传统：所有显示声明的成员的最好
    - 现在：每个对象的最前端

**静态数据成员：**存放在程序的静态/全局变量区，与类对象无关

**访问控制区域（acesss section）：**

- 1.指的是由public、private、protected声明的区域
- 2.区域内部的变量是按声明顺序进行存放的
- 3.区域之间并不保证与声明顺序一致，但区域之间，一般来说是连在一起，并按顺序存放的
- 4.区域个数的多少，不会影响类对象所占的空间

## 3.3数据成员的存取

### 3.3.1 静态数据成员

静态成员（数据成员、成员函数）的存取效率：使用对象和使用指针来访问静态成员，实际上都是通过`::`来访问

静态成员（数据成员、成员函数）的继承：静态成员可以被继承

- 1.继承的静态成员函数，派生类调用该函数时，是基类的实现版本
- 2.继承的静态数据成员，派生类与基类指向的是同一块数据，作为引用计数时要小心

### 3.3.2 非静态数据成员

```c++
//origin是类Point3d的一个对象
origin._y = 0.0;

//编译器的行为，&origin._y实际上等于
&origin + (&Point3d::y - 1);
//(&Point3d::y - 1)   为y的偏移位置
```

注意这里的-1，指向数据成员的指针，它的offset总是被加上1，目的是，用于区分：

- 1.一个指向数据成员的指针，用以指出类的第一个成员
- 2.一个指向数据成员的指针，没有指向任何成员（3.6节详细讲）

每个非静态成员的偏移位置在编译时期就可获知，即使该成员是基类的子对象的成员

**存取效率的比较：**

- 1.非虚继承，存取基类数据成员和派生类定义的数据成员的效率是一样的
- 2.虚继承，效率会比非虚继承慢，因为需要经过虚基指针寻址

**通过对象和指针访问数据成员的区别**

- 1.访问静态数据成员：没区别，都是通过`::`来访问，都是编译时确定
- 2.访问非静态数据成员
  - 1.无继承：没区别，都是编译时确定
  - 2.非虚继承：没区别，都是编译时确定
  - 3.虚继承：有区别
    - 指针访问：运行时访问，因为编译期间无法确定虚基指针，需要在运行时根据虚基指针间接导引获得
    - 对象访问：编译时确定

## 3.4 继承与数据成员

下面分四个部分讨论

- 1.单一继承且不含虚函数（只要继承不要多态）
- 2.单一继承并含虚函数（加上多态）
- 3.多重继承
- 4.虚继承

所有的讨论基于这样的一个例子：

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_1_a_个别structs的数据布局.png)

### 3.4.1 单一继承且不含虚函数

非虚继承不会增加空间和存取效率上的额外负担

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_1_b_单一继承并且没有虚函数时的数据布局.png)

但因为“对齐”，使用非虚继承还是会导致空间上的负担：

**不使用继承时：**

![](../../pics/language/Inside_the_C++_Object_Model/Concrete对象.png)

对象的大小为8bytes（4+1+1+1+对齐的1）

**使用非虚继承后**

![](../../pics/language/Inside_the_C++_Object_Model/Concrete使用非虚继承1.png)

![](../../pics/language/Inside_the_C++_Object_Model/Concrete使用非虚继承2.png)

Concrete1为8bytes（4+1+对齐的3）

Concrete2为12bytes（Concrete1的8+1+对齐的3）

Concrete3为16bytes（Concrete2的12+1+对齐的3）

**在继承的子对象直接要保证对齐的目的：**

基类与派生类相互赋值的行为将会出错，如图所示，如果没有子对象之间的对齐，Concrete1对象赋值给Concrete2对象时，将会出错

![](../../pics/language/Inside_the_C++_Object_Model/非虚继承时不进行子对象间的对齐.png)

### 3.4.2 单一继承并含虚函数

 单一继承并含虚函数带来的额外负担有：

- 1.为每个类维护一个虚函数表，该表的slot个数一般为虚函数个数+一或两（用于存放runtime type identification，如type_info）
- 2.为每个该类的对象导入一个虚函数表指针vptr，提供运行时的链接
- 3.加强构造函数，使构造函数在构造对象时能为vptr设定初值，让对应类的虚函数表
- 4.加强析构函数，需要析构虚函数表指针

**虚函数表指针的位置：**

- 1.类对象的尾端（例如cfron编译器）
  - 好处：可以保留基类C struct的对象布局，因而允许在C程序代码中也能使用（基类C struct中没有虚函数）

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_2_a_Vptr被放在类的尾端.png)

- 2.类对象的头部
  - 好处：在多重继承下，通过指向类成员的指针调用虚函数更方便
  - 坏处：
    - 不能保留基类C struct的对象布局（基类C struct中没有虚函数）
    - 由派生类对象取址赋值给基类的指针时，需要编译器调整地址

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_2_b_Vptr被放在类的前端.png)

```c++
//上面例子的代码
struct no_virts {
	int d1;
	int d2;
};

class has_vrts : public no_virts {
public:
	virtual void foo();
private:
	int d3;
};

//使用VS打印的结果如下，因此VS采用的是将虚指针放置与类对象前端的方式
1>class has_vrts	size(16):
1>	    +---
1> 0	| {vfptr}
1> 4	| +--- (base class no_virts)
1> 4	| | d1
1> 8	| | d2
1>	    | +---
1>12	| d3
1>	    +---
1>
1>      has_vrts::$vftable@:
1>	    | &has_vrts_meta
1>	    |  0
1> 0	| &has_vrts::foo
1>
1>has_vrts::foo this adjustor: 0
```

### 3.4.3 多重继承

多重继承时，如果将派生类对象地址（指针）赋值给基类指针时，有可能需要修改偏移的操作

![](../../pics/language/Inside_the_C++_Object_Model/多重继承1.png)

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_4_数据布局_多重继承.png)

```c++
//派生类对象地址赋值给基类指针的例子
Vertex3d v3d;
Vertex *pv;
Point2d *p2d;
Point3d *p3d;

//需要修改偏移
pv = &v3d;
//编译器的行为
pv = (Vertex*)( ((char*)&v3d) + sizeof( Point3d ) );

//不需要修改偏移
p2d = &v3d;
p3d = &v3d;

//派生类指针赋值给基类指针的例子
Vertex3d *pv3d;
//需要修改偏移值
pv = pv3d;
//编译器的行为
//如果pv3d为0，表示为nullptr，则此时pv也应该设为空
//如果pv3d不为0，则修改偏移
pv = pv3d ? (Vertex*)( ((char*)&v3d) + sizeof( Point3d ) ) : 0;
```

### 3.4.4 虚继承

非虚多重继承和虚多重继承的区别：

![](../../pics/language/Inside_the_C++_Object_Model/非虚多重继承与虚多重继承的区别.png)

实现虚继承主要有三种主流策略

- 1.在每一个直接派生类（比如istream、ostream）中安插一些指针，每个指针指向一个虚基类，要想获取继承来的虚基类成员，可以通过相关指针间接完成

**1.直接派生类中安插指针**

![](../../pics/language/Inside_the_C++_Object_Model/虚继承实现方式1_例子.png)

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_5_a_虚继承.png)

```c++
//通过相关间接获取虚基类成员
//例子1
void Point3d::operator += ( const Point3d &rhs )
{
    _x += rhs._x;
    _y += rhs._y;
    _z += rhs._z;
}
//编译器的行为
void Point3d::operator += ( const Point3d &rhs )
{
    this->__vbcPoint2d->_x += rhs.__vbcPoint2d->_x;
    this->__vbcPoint2d->_y += rhs.__vbcPoint2d->_y;
    this->_z += rhs._z;
}

//例子2，派生类指针向虚基类指针的转换
Point2d *p2d = pv3d;
//编译器的行为
Point2d *p2d = pv3d ? pv3d->__vbcPoint2d : 0;
```



这样实现的缺点：

- 1.每个对象必须对其每一个虚基类背负一个额外的指针。我们希望类对象有固定的负担，不因为其虚基类的个数而有所变化

  - 解决方法有两种：
    - a.使用虚基类表，表中存放指向虚基类的指针
    - b.使用虚基类表，表中存放虚基类的偏移量

- 2.由于虚继承串链的加长，导致间接存取层次的增加（如果有三次虚继承，则需要三次间接存取）。我们希望有固定的存取时间，不因为虚继承的深度而改变

  - 解决方法：经由拷贝操作所得所有嵌套的虚基指针，放到派生类对象中，以解决“固定存取时间”的问题。代价是需要更多的空间来存取指针


**对于使用虚基类表，存放表中虚基类的偏移量方法的详细解释**

使用该方法时，通常可以将虚基类偏移量与虚函数表中的指针放在一个表中，其中该表的正偏移量存放虚函数的指针，表的负偏移量存放虚基类的偏移量

![](../../pics/language/Inside_the_C++_Object_Model/Pic_3_5_b_虚继承.png)

```c++
//例子1
void Point3d::operator += ( const Point3d &rhs )
{
    _x += rhs._x;
    _y += rhs._y;
    _z += rhs._z;
}
//编译器的行为
void Point3d::operator += ( const Point3d &rhs )
{
    (this + __vptr__Point3d[-1])->_x += ( &rhs + rhs.__vptr__Point3d[-1] )->__x;
    (this + __vptr__Point3d[-1])->_y += ( &rhs + rhs.__vptr__Point3d[-1] )->__y;
    this->_z += rhs._z;
}

//例子2，派生类指针向虚基类指针的转换
Point2d *p2d = pv3d;
//编译器的行为
Point2d *pd2 = pv3d ? pv3d + pv3d->__vptr__Point3d[-1] : 0;
```

## 3.6 指向数据成员的指针

取一个类的非静态数据成员的地址，将会得到它在类中的偏移值。这种方法存取数据成员，效率更低

- `&Point3d::z`
- `float Point3d::*p1 = &Point3d::z; ` 

取一个真正绑定于类对象上的数据成员的地址，将会得到该成员在内存中的真正地址

- `&ob.z`，其中ob为Point3d的一个对象
- `int *p2 = &ob.z;`

[《C++Primber》笔记 第IV部分---19.4类成员指针](https://guanjunjian.github.io/2017/02/09/study-cpp-primer-summary_4/)

```c++
//下面的结果基于VS2017
class Point3d {
public:
	virtual ~Point3d();
	static void print()
	{
		printf("&Point3d::x = %p\n", &Point3d::x); //输出00000004
		printf("&Point3d::y = %p\n", &Point3d::y); //输出00000008
		printf("&Point3d::z = %p\n", &Point3d::z); //输出0000000C
	}
protected:
	static Point3d origin;
	float x, y, z;
};

int main(int argc, char* argv[])
{
	
	Point3d::print();
	system("pause");
	return 0;
}

//Point3d的内存布局
1>class Point3d	size(16):
1>	    +---
1> 0	| {vfptr}
1> 4	| x
1> 8	| y
1>12	| z
1>	    +---
1>
1>       Point3d::$vftable@:
1>	    | &Point3d_meta
1>	    |  0
1> 0	| &Point3d::{dtor}
```

书中有不同的解答：

```c++
//书中BCB3编译器的输出结果为：
class Point3d {
public:
	virtual ~Point3d();
	static void print()
	{
		printf("&Point3d::x = %p\n", &Point3d::x); //输出00000005
		printf("&Point3d::y = %p\n", &Point3d::y); //输出00000009
		printf("&Point3d::z = %p\n", &Point3d::z); //输出0000000D
	}
protected:
	static Point3d origin;
	float x, y, z;
};
```

书中BCB3中多出的1byte的解释为：为了区分“没有指向任何数据成员”的指针和“一个指向第一个数据成员”的指针（这种情况仅发生在将虚函数表放在末尾或没有虚函数的情况），考虑下面的情况：

```c++
float Point3d::*p1 = 0;
float Point3d::*p2 = &Point3d::x;

//这里该如何区分
//如果对指针数据成员的指针都加1的偏移量，那么就可以通过00000001是指向第一个数据成员，而00000000表示没有指向任何数据成员来区分
if( p1 == p2 ){}
```

**在多重继承后，类成员指针将会变得复杂**

看如下例子：

```c++
struct Base1 { int val1; };
struct Base2 { int val2; };
struct Derived : public Base1, public Base2 {};

void fun1( int Derived::*dmp, Derived *pd )
{
    //期待第一个参数得到的是一个“指向派生类的成员”的指针
    //如果传进来的是一个“指向基类成员”的指针，会怎样？
    pd->*dmp;
}

void fun2( Derived *pd )
{
    //bmp将成为1
    int Base2::*bmp = &Base2::val2;
    //bmp为1，但在派生类pd中，val2的偏移量应该是5，因此需要编译器的转换
    func1( bmp, pd );
}

//编译器的行为
void fun2( Derived *pd )
{
    int Base2::*bmp = &Base2::val2;
    func1( bmp ? bmp + sizeof( Base1 ) : 0 , pd );
}
```

# 第4章 函数语意学

函数分类

- 1.非静态成员函数
- 2.虚成员函数
- 3.静态成员函数

## 4.1 成员的各种调用方式

### 4.1.1 非静态成员函数

实际上**成员函数**会内化为**非成员函数**的形式，步骤如下：

- 1.改写函数原型，安插一个额外的参数this指针到成员函数中，用以提供一个存取管道，使类对象得以将此函数调用
- 2.对每一个非静态成员的存取操作改为经由this指针来存取
- 3.将成员函数重写为一个外部函数（extern），函数名经过mangle处理，使得它在程序中成为唯一的
  - 成员（数据成员、成员函数）名称前一般会加上类名、参数个数、参数类型等（用以重载）

```c++
//成员函数例子1，转化前
Point3d Point3d::normalize() const
{
    register float mag = magnitude();
    Point3d normal;
    
    normal._x = _x / mag;
    normal._y = _y / mag;
    normal._z = _z / mag;
    return normal;
}

//成员函数例子1，转换后
//Point3d拥有拷贝构造函数，且NRV优化启用
// 1.、3.
extern void magnitude__7Point3dFv(register const Point3d *const this, Point3d &__result);

void magnitude__7Point3dFv(register const Point3d *const this, Point3d &__result)
{
    // 2.
    register float mag = this->magnitude();
    //默认构造函数
    //__result用以取代返回值
    __result.Point3d::Point();
    __result._x = this->_x / mag;
    __result._y = this->_y / mag;
    __result._z = this->_z / mag;
    return;
}

//成员函数例子2，直接构建normal，转化前
//这可以节省默认构造函数引起的额外负担
Point3d Point3d::normalize() const
{
    register float mag = magnitude();
    normal._x = _x / mag;
    normal._y = _y / mag;
    normal._z = _z / mag;
    return Point3d(_x / mag, _y / mag, _z / mag);
}

//成员函数例子2，直接构建normal，转化后
void magnitude__7Point3dFv(register const Point3d *const this, Point3d &__result)
{
    register float mag = this->magnitude();
    //非默认构造函数
    //__result用以取代返回值
    __result.Point3d::point3d(this->_x / mag, this->_y / mag, this->_z / mag);
    return;
}

```

调用操作也需要修改

```c++
Point3d obj;
Point3d *ptr = &obj;
//修改前
Point3d result1 = obj.magnitude();
Point3d result2 = ptr->magnitude();

//修改后
magnitude__7Point3dFv( &obj, result1 );
magnitude__7Point3dFv( ptr, result2 );
```

### 4.1.2 虚成员函数

在4.2将详细介绍

**注意区别：**

- 1.指针调用虚函数与对象调用虚函数
- 2.虚函数内调用同类虚函数

```c++
//1.指针调用虚函数与对象调用虚函数

//指针调用虚函数
ptr->normalize();
//编译器的行为
/*
** vptr虚函数指针，指向该类的虚函数表，安插在每一个类对象中，其名称也会被mangle
** 函数传入ptr，作为this指针
*/
(*ptr->vptr[1])(ptr);

//对象调用虚函数
obj.normalize();
//编译器的行为
//这样是不必要的，实际上编译器不会这样做
(*obj.vptr[1])(&obj);
//编译器实际上是这样做，即“经由一个类对象调用虚函数”与“调用非静态成员函数”没区别
normalize_7Point3dFv( &obj );
```

```c++
//2.虚函数内调用同类虚函数
//假设normalize()为虚函数，magnitude()也为虚函数
Point3d Point3d::normalize() const
{
    register float mag = magnitude();
    Point3d normal;
    
    normal._x = _x / mag;
    normal._y = _y / mag;
    normal._z = _z / mag;
    return normal;
}

//其中的register float mag = magnitude()
//编译器的行为
//这样是不必要的，实际上编译器不会这样做
register float mag = ( *this->vptr[2] )(this);
//编译器实际上是这样做
//因为Point3d::magnitude()是在Point3d::normalize()的范围内调用，因为Point3d::normalize()已经确定了this的类型，因而这里的magnitude()可以直接使用类型调用，效率更高
register float mag = Point3d::magnitude();
```

### 4.1.3 静态成员函数

静态成员函数的**主要特性**：没有this指针

静态成员函数的**次要特性**（根源于其主要特性）：

- 1.不能直接存取类的非静态成员（数据成员、成员函数）
- 2.不能被声明为const（const成员函数）、volatile或virtual
- 3.不需要经过类对象调用

**静态成员函数定义的编译器转换过程：**

```c++
class Point3d{
public:
    static unsigned int object_count();
    ....
};
//非静态成员函数的定义
unsigned int Point3d::object_count();
{
    return _object_count;
}

//编译器的行为
//注意：1.mangle名称；2.没有this指针作为参数
unsigned int object_count_5dPoint3dSFv()
{
    return object_count_5Dpoint3d;
}
```

**静态成员函数调用的编译器转换过程：**

```c++
//指针调用
ptr->object_count();
//编译器的行为
object_count_5dPoint3dSFv();

//对象调用
obj.object_count();
//编译器的行为，与指针调用没差别
object_count_5dPoint3dSFv();
```

**取址静态成员函数**

[《C++Primber》笔记 第IV部分---19.4类成员指针](https://guanjunjian.github.io/2017/02/09/study-cpp-primer-summary_4/)

背景知识，成员函数指针：

```c++
class Screen {
    char get_cursor() const { return contents[cursor]; }
    inline char get(pos ht, pos wd) const;
}
char (Screen::*pm2)(Screen::pos,Screen::pos) const;

Screen myScreen, *pScreen = &myScreen;
char c1 = (pScreen->*pmf2)(0,0);
char c2 = (myScreen.*pmf2)(0,0);
```

但取一个**静态成员函数的地址**与取**非静态成员函数的地址**得到的指针类型不一样

```c++
unsigned int (*f1)();
//正确，&Point3d::object()返回的类型为unsigned int (*)();
f1 = &Point3d::object();

unsigned int (Point3d::*f2)();
//错误，&Point3d::object()的返回类型不为unsigned int (Point3d::*)();
f2 = &Point3d::object();
```

## 4.2 虚成员函数

对于一个由虚函数的类以及类成员，在编译期和执行期分别有不同的工作要做

**编译期工作：**

- 1.为类生成一个虚函数表，在虚函数表中为每个虚函数生成一个表格索引值（虚函数地址）
- 2.为类对象安插一个虚函数表指针，指向虚函数表

**执行期工作：**在特定的虚函数表slot（记录着虚函数的地址）中激活虚函数

**虚函数表中包括：**

- 1.该类定义的虚函数实例。即该类重写了基类的虚函数或该类自定义了新的虚函数
- 2.继承自基类的虚函数实例。即该类没有重写基类的对应虚函数时，才会有
- 3.一个`pure_virtual_called()`函数实例。它的作用：
  - 纯虚函数的空间保卫者
  - 作为执行期异常处理函数

### 4.2.1 单继承下的虚函数

```c++
//存虚函数在内存中的表现
class Test {
public:
	virtual void fun1() = 0;
	virtual void fun2() { cout << "hello" << endl; }
};
1>class Test	size(4):
1>	    +---
1> 0	| {vfptr}
1>	    +---
1>
1>       Test::$vftable@:
1>	    | &Test_meta
1>	    |  0
1> 0	| &Test::fun1
1> 1	| &Test::fun2
```

书本中相关例子：

**无派生时**

```c++
class Point{
public:
    //slot0用于存放type_info，用于RTTI
    //在slot1
    virtual ~Point();
    //在slot2，pure_virtual_called()，如果该函数被以外调用，通常的操作是结束掉这个程序
    virtual Point& mult( float ) = 0;
    
    //非虚函数，因此在表中没有
    float x() const { return x; }
    //在slot3
    virtual float y() const { return 0; }
    //在slot4
    virtual float z() const { return 0; }

protected:
    Point( float x = 0.0 );
    float _x;
};
```

![](../../pics/language/Inside_the_C++_Object_Model/Pic_4_1_虚函数表的布局_单一继承情况_1.png)

**直接继承**

```c++
class Point2d : public Point {
public:
    Point2d( float x = 0.0, float y = 0.0 ) : Point( x ), _y(y) {};
    //重写
    ~Point2d(){}
    //纯虚函数被重写，注意这里的返回类型，是基类的派生类的引用，这是允许的
    Point2d& mult( float );
    //重写
    float y() const { return _y; }
    //z()没有重写，因此在虚函数表中还是Point::z()
protected:
    //新添加的元素
    float _y;
}
```

![](../../pics/language/Inside_the_C++_Object_Model/Pic_4_1_虚函数表的布局_单一继承情况_2.png)

**间接继承**

```c++
class Point3d : public Point2d {
public:
    Point3d( float x = 0.0, float y = 0.0, float z = 0.0 ) : Point2d( x, y ),_z( z ) {}
    //重写
    ~Point3d();
    
    //重写
    Point3d& mult( float );
    //重写
    float z() const { return _z; }

private:
    //新添加的元素
	float _z;    
};
```

![](../../pics/language/Inside_the_C++_Object_Model/Pic_4_1_虚函数表的布局_单一继承情况_3.png)	

**虚函数的调用**

```c++
ptr->z();
//如果ptr不为空
( *ptr->vptr[4] )( ptr );
```

### 4.2.2 多重继承下的虚函数

```c++
class Base1 {
public:
	Base1();
	virtual ~Base1();
	virtual void speakClearly();
	virtual Base1 *clone() const;
protected:
	float data_Base1;
};

class Base2 {
public:
	Base2();
	virtual ~Base2();
	virtual void mumble();
	virtual Base2 *cline() const;
protected:
	float data_Base2;
};

class Derived : public Base1, public Base2 {
public:
	Derived();
	virtual ~Derived();
	virtual Derived *clone() const;
protected:
	float data_Derived;
};

//使用VS生成的内存分布图
//Base1的内存分布图
1>class Base1	size(8):
1>	    +---
1> 0	| {vfptr}
1> 4	| data_Base1
1>	    +---
1>
1>        Base1::$vftable@:
1>	    | &Base1_meta
1>	    |  0
1> 0	| &Base1::{dtor}  // Base1析构函数
1> 1	| &Base1::speakClearly
1> 2	| &Base1::clone

//Base2的内存分布图
1>class Base2	size(8):
1>	    +---
1> 0	| {vfptr}
1> 4	| data_Base2
1>	    +---
1>
1>       Base2::$vftable@:
1>	    | &Base2_meta
1>	    |  0
1> 0	| &Base2::{dtor}  // Base2析构函数
1> 1	| &Base2::mumble
1> 2	| &Base2::cline

//Derived的内存分布图
1>class Derived	size(20):
1>	    +---
1> 0	| +--- (base class Base1)
1> 0	| | {vfptr}
1> 4	| | data_Base1
1>	    | +---
1> 8	| +--- (base class Base2)
1> 8	| | {vfptr}
1>12	| | data_Base2
1>	    | +---
1>16	| data_Derived
1>	     +---
1>
1>       Derived::$vftable@Base1@:
1>	    | &Derived_meta
1>	    |  0
1> 0	| &Derived::{dtor}  // Base1虚函数表中的Derived析构函数
1> 1	| &Base1::speakClearly
1> 2	| &Derived::clone
1>
1>        Derived::$vftable@Base2@:
1>	    | -8
1> 0	| &thunk: this-=8; goto Derived::{dtor}  // Base2虚函数表中的Derived析构函数
1> 1	| &Base2::mumble
1> 2	| &Base2::cline
```

书中的布局：

![](../../pics/language/Inside_the_C++_Object_Model/Pic_4_2_虚函数表的布局_多重继承情况.png)

（上图有一个问题，为什么在Base1的表中会有`Base2::mumble()`//TODO）

在多重继承下，一个派生类内含n-1个额外的虚函数表（n表示上一层基类的个数），对于本例来说，会有两个虚函数表：

- 1.一个主要表格，与Base1（派生顺序中最左端的基类）共享，如果派生类有新的虚构函数，添加到该表上
  - 表名：`vtbl__Derived`
  - 将Derived对象指定给Base1指针或Derived指针时，被处理的虚函数表是主要表格`vtbl__Derived`
- 2.一个次要表格，与Base2（派生顺序中第二个基类）有关
  - 表名：`vtbl__Base2__Derived`
